Tekla Open API Reference for Tekla Structures 2025
ICurve.EndPoint Property
 Gets the end point of the curve. May be the same as StartPoint if the curve is closed.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
Point EndPoint { get; }
ReadOnly Property EndPoint As Point
	Get
Property Value
Type: Point
See Also
Reference
ICurve Interface
Tekla.Structures.Geometry3d Namespace